БазаЕДТ/src/DataProcessors/ВыгрузкаВЭксель/ВыгрузкаВЭксель.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВыгрузкаВЭксель</name>
  <attributes>
    <name>КаталогСохранения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

БазаЕДТ/src/DataProcessors/ВыгрузкаВЭксель/Forms/Форма/Module.bsl
// @strict-types
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыгрузитьВЭксель(Команда)

	Режим = РежимДиалогаВыбораФайла.ВыборКаталога;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.Каталог = "";
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Выберите каталог для выгрузки";

	ДопПараметры = Новый Структура("Диалог", ДиалогОткрытияФайла);
	Оповещение = Новый ОписаниеОповещения("ВыгрузитьЗавершение", ЭтотОбъект, ДопПараметры);

	ДиалогОткрытияФайла.Показать(Оповещение);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Оповещение о завершении выгрузки.
// Параметры:
//  Результат - Булево - результат операции.
//  ДополнительныеПараметры - Структура - дополнительные параметры.
&НаКлиенте
Процедура ПослеЗаписиФайла(Результат, ДополнительныеПараметры) Экспорт
	Если Результат Тогда
		ПоказатьОповещениеПользователя("Выгрузка данных успешно завершена!");
	Иначе
		ПоказатьОповещениеПользователя("Не удалось сохранить файл.");
	КонецЕсли;
КонецПроцедуры

// Параметры:
//  Наименование - Строка. 
//  Количество - Число.
//  ТабДок - ТабличныйДокумент.
&НаСервере
Процедура ЗаполнитьТаблицуНаСервере(ТабДок)

	Макет = Обработки.ВыгрузкаВЭксель.ПолучитьМакет("Макет");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");

	 Для Каждого СтрокаТЧ Из Объект.Товары Цикл
 
		//@skip-check property-return-type
		ОбластьСтрока.Параметры.Наименование = СтрокаТЧ.Номенклатура;
		//@skip-check property-return-type
		ОбластьСтрока.Параметры.Количество   = СтрокаТЧ.Количество;

		ТабДок.Вывести(ОбластьСтрока);

	КонецЦикла;

КонецПроцедуры

//Параметры:
//  ВыбранныеФайлы - Массив из Строка.
//  ДополнительныеПараметры - Структура.
&НаКлиенте
Процедура ВыгрузитьЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт

		Если ВыбранныеФайлы = Неопределено ИЛИ ВыбранныеФайлы.Количество() = 0 Тогда
			Возврат;
	КонецЕсли;

	ПутьККаталогу = ВыбранныеФайлы[0];

	Если Прав(ПутьККаталогу, 1) <> "\" Тогда
		Объект.КаталогСохранения = ПутьККаталогу + "\";
	Иначе
		Объект.КаталогСохранения = ПутьККаталогу;
	КонецЕсли;

	ДатаИВремя = СтрЗаменить(Строка(ТекущаяДата()), ":", ".");
	ИмяФайла = "Импорт_" + ДатаИВремя;
	ПолноеИмяФайла = Объект.КаталогСохранения + ИмяФайла + ".xls";

	ТабДок = Новый ТабличныйДокумент;
	ЗаполнитьТаблицуНаСервере(ТабДок);

	ОповещениеОЗаписи = Новый ОписаниеОповещения("ПослеЗаписиФайла", ЭтотОбъект);
	ТабДок.НачатьЗапись(ОповещениеОЗаписи, ПолноеИмяФайла, ТипФайлаТабличногоДокумента.xls);

КонецПроцедуры

#КонецОбласти
